tiborsimon/embedded-tdd-headers/pic/8bit/pic18f2220_tdd.h
#define T0CON                         522
#define T0PS                          523
#define T0PS0                         524
#define T0PS1                         525
#define T0PS2                         526
#define PSA                           527
#define T0PS3                         528
#define T0SE                          529
#define T0CS                          530
#define T08BIT                        531
#define T016BIT                       532
#define TMR0ON                        533
#define STATUS                        534
#define C                             535
#define CARRY                         536
#define DC                            537
#define ZERO                          538
#define Z                             539
#define OV                            540
#define OVERFLOW                      541
#define N                             542
#define NEGATIVE                      543
#define INTCON3                       544
#define INT1IF                        545
#define INT1F                         546
#define INT2IF                        547
#define INT2F                         548
#define INT1E                         549
#define INT1IE                        550
#define INT2IE                        551
#define INT2E                         552
#define INT1P                         553
#define INT1IP                        554
#define INT2IP                        555
#define INT2P                         556
#define INTCON2                       557
#define RBIP                          558
#define TMR0IP                        559
#define T0IP                          560
#define INTEDG2                       561
#define INTEDG1                       562
#define INTEDG0                       563
#define RBPU                          564
#define NOT_RBPU                      565
#define nRBPU                         566
#define INTCON                        567
#define RBIF                          568
#define INT0F                         569
#define INTF                          570
#define INT0IF                        571
#define T0IF                          572
#define TMR0IF                        573
#define RBIE                          574
#define INTE                          575
#define INT0E                         576
#define INT0IE                        577
#define T0IE                          578
#define TMR0IE                        579
#define PEIE                          580
#define PEIE_GIEL                     581
#define GIEL                          582
#define GIE_GIEH                      583
#define GIE                           584
#define GIEH                          585
#define STKPTR0                       586
#define STKPTR                        587
#define SP0                           588
#define STKPTR1                       589
#define SP1                           590
#define STKPTR2                       591
#define SP2                           592
#define SP3                           593
#define STKPTR3                       594
#define STKPTR4                       595
#define SP4                           596
#define STKUNF                        597
#define STKOVF                        598
#define STKFUL                        599

#endif // _PIC18F2220_H_
